from __init__ import *
import json
struct_file = "./upload_res.json"
output_file = "./result.json"

lookup = Lookup()

idf = json.load(open("idf.stat"))

class DataHandler:
    datas = {}
    def __init__(self):
        self.get_data()

    def get_data(self):
        with open(Params.struct_file) as f:
            for line in f:
                d = json.loads(line)
                if d["question_id"] in self.datas:
                    d["spans"].append(d["spans"])
                    d["answers"].append(lookup.get_answer_content_by_passageID_spans(d["passage_id"], d["spans"]))
                    if len(d["answers"]) >= 3:
                        print(d["question_id"])
                else:
                    self.datas[d["question_id"]] = {
                        "question_id": d["question_id"],
                        "question_type": lookup.get_question_type_by_questionID(d["question_id"]),
                        "answers": [lookup.get_answer_content_by_passageID_spans(d["passage_id"], d["spans"])],
                        "yesno_answers": [],
                        "entity_answers": [[]],
                        "spans": [d["spans"]], 
                    }
    
    def process_data(self):

        for answer in self.datas:
            if answer["question_type"] == "YES_NO":
                pass
            elif answer["question_type"] == "YES_NO":
                pass


    def align_data(self):
        pass

import word2vec, math
model = word2vec.load("wordsVec.bin")

def cosine(vec1, vec2):
    """
        vec1, vec2: two vector, no limited dimesi
    """
    dot_product = 0.0;  
    normA = 0.0;  
    normB = 0.0;  
    for x1, x2 in zip(vec1, vec2):  
        dot_product += x1 * x2  
        normA += x1 ** 2  
        normB += x2 ** 2  
    """if normA == 0.0 or normB==0.0:  
        return None
    else:  """
    return dot_product / ((normA*normB)**0.5)  

def get_cos(question, passage):
    if not (vocabulary.getVocabID(question) and vocabulary.getVocabID(passage)):
        score = 0
        for char_pair in product(question, passage):
            score += (1 if char_pair[0] == char_pair[1] else -1)
        score /= len(char_pair)
    else:
        cos = cosine(model.get_vector(question), model.get_vector(passage))
    
    return (math.exp(-cos) if cos >= 0 else math.exp(cos))

from itertools import product

def score(question, passage, tf_idf):
    """
        question: a token of question, string
        passage : a token too. string
        tf_idf: passage token's tf_idf
    """
    return get_cos(question, passage) * tf_idf


def match_score(question, passage):
    """
        question: a list of segmented question
        passage : list, segmented
    """
    count = {}
    for p in passage:
        count[p] = count.get(p) + 1
    scores = filter(lambda x: x != 0, [score(*pair, count.get(pair[0], 1) * idf.get(pair[1], math.log(article_count))) for pair in product(question, passage)])  # filter 0

    return sum(scores) / len(scores)



if __name__ == "__main__":
    for q, p in gen_test():
        print(match_score(q, p), "".join(p))

    #DataHandler().process_data()  
    """res = {}
    with open("./result.json") as f:
        for line in f:
            d = json.loads(line)
            if d["question_id"] in res:
                res[d["question_id"]]["answers"].append(d["answers"][0])
            else:
                res[d["question_id"]] = d

    with open("result2.json", "w") as f:
        for r in res.values():
            f.write(json.dumps(r, ensure_ascii=False) + "\n")"""

def gen_test():
    for doc in test()["documents"]:
        for para in doc["segmented_paragraphs"]:
            yield test()["segmented_question"], para


def test():
    return {
	"documents": [{
		"is_selected": True,
		"title": "吴昌硕字画价格到底是多少",
		"most_related_para": 0,
		"segmented_title": ["吴昌硕", "字画", "价格", "到底", "是", "多少"],
		"segmented_paragraphs": [
			["要", "看", "品", "相", "和", "尺寸大小", "，", "吴昌硕", "好多", "字画", "由", "其", "弟子", "代", "画", "然后", "盖其章", "，", "真迹", "精品", "每", "平尺", "大约", "在", "三", "十", "至", "五", "十", "万", "不等", "。", "供参考"],
			["无价之宝", "，", "可以", "上", "拍卖行", "的", "网", "看看", "，", "或", "都", "有", "些", "拍卖", "的", "书", "都", "有", "写"]
		],
		"paragraphs": ["要看品相和尺寸大小，吴昌硕好多字画由其弟子代画然后盖其章，真迹精品每平尺大约在三十至五十万不等。供参考", "无价之宝，可以上拍卖行的网看看，或都有些拍卖的书都有写"],
		"bs_rank_pos": 1
	}, {
		"is_selected": True,
		"title": "吴昌硕字画2016年最1新拍卖成交价格多少",
		"most_related_para": 0,
		"segmented_title": ["吴昌硕", "字画", "2016", "年", "最", "1", "新", "拍卖", "成交价格", "多少"],
		"segmented_paragraphs": [
			["<", "p", ">", "<", "strong", ">", "最近", "行情", "价", "，", "360", "万", "，", "<", "/", "strong", ">", "<", "/", "p", ">", "<", "p", ">", "<", "br", "/", ">", "<", "/", "p", ">", "<", "p", ">", "藏品", "鉴定", "出售", "一定要去", "行业", "内", "<", "br", "/", ">", "<", "br", "/", ">", "属于", "常规", "的", "注册", "单位", "，", "不用担心", "，", "因为", "现在注册", "个", "拍卖公司", "成本", "不到", "壹", "万", "伍", "仟", "元", "，", "所以", "注册", "很方便", "，", "藏", "家", "无需", "担心", "公司", "是", "假", "的", "，", "多", "与", "工作", "人员", "联系", "，", "费用", "能", "接受", "就", "参加", "。", "<", "br", "/", ">", "<", "br", "/", ">", "经营", "古董", "类", "的", "单位", "不少", "，", "参与", "前", "一定", "问", "清楚", "，", "觉得", "适合", "再", "去", "参加", "，", "一旦", "流拍", "后", "要", "能", "接受", "费用", "损失", "的", "现实", "，", "否则", "悔", "之", "晚", "也", "。", "<", "br", "/", ">", "<", "br", "/", ">", "其次", "藏品", "最安全", "的", "交易", "方法", "去", "摆地摊", "卖掉", "，", "没", "任何", "损失", "，", "还", "现金", "交易", "。", "<", "br", "/", ">", "<", "br", "/", ">", "以下", "为", "藏品", "交易", "与", "参加", "拍卖", "的", "常识", "：", "<", "br", "/", ">", "<", "br", "/", ">", "请", "仔细阅读", "，", "避免上当受骗", "。", "我", "本人", "参加", "拍卖", "七", "八", "年", "，", "总计", "花费", "25", "万", "以上", "，", "有血有泪", "，", "在", "此", "公平", "客观", "的", "回答", "，", "是", "为了", "让", "更多", "的", "藏", "家", "少", "受", "一", "分", "伤害", "，", "阿弥托佛", "，", "苦海无边", "，", "回头是岸", "。", "<", "br", "/", ">", "<", "br", "/", ">", "藏", "友", "问", "某某", "公司", "是否", "正规", "？", "<", "br", "/", ">", "<", "br", "/", ">", "是不是", "骗子", "？", "可靠", "吗", "？", "任何", "单位", "都是", "法制", "注册", "营业", "的", "，", "至于", "服务", "质量", "，", "收费", "的", "标准", "，", "得", "自己去", "考察", "衡量", "，", "一定", "谨慎", "避免", "高", "收费", "，", "藏品", "不", "成交", "造成", "的", "伤害", "。", "特别", "是", "夸口说", "保证", "能", "成交", "的", "公司", "，", "十有八九", "骗", "费用", "的", "公司", "。", "法律", "规定", "正规", "单位", "不能", "收购", "倒卖", "古董", "，", "其次", "个别", "单位", "以", "现金收购", "古董", "为", "名", "，", "让", "藏", "家", "先", "鉴定", "，", "真品", "就", "现金收购", "，", "其实", "他们", "没有", "买家", "，", "忽悠", "藏", "家", "交", "完", "鉴定", "费", "后", "，", "鉴定", "时", "故意", "告诉", "你", "的", "东西", "是", "假", "的", "。", "鉴定", "费", "不退", "了", "，", "保证金", "也", "不", "退", "了", "。", "<", "br", "/", ">", "<", "br", "/", ">", "其次", "很多", "业务员", "自称", "经理", "，", "总监", "，", "王", "总", "什么", "的", "，", "天天", "打电话", "忽悠", "藏", "家", "，", "其实", "就是", "普通", "业务员", "拉皮条", "，", "专", "忽悠", "没见识", "的", "老实人", "，", "然后", "说", "能", "把", "你", "介绍", "，", "拉拢", "到", "五", "六家", "拍卖公司", "去", "缴费", "，", "等你", "委托", "缴费", "后", "，", "业务员", "与", "公司", "一人一半", "分", "你", "的", "委托", "费", "。", "你", "想想", "这", "是", "公司", "吗", "？", "<", "br", "/", ">", "<", "br", "/", ">", "还有", "，", "动不动", "在", "网站", "把", "十", "几", "位", "知名", "专家", "的", "照片", "贴", "在", "网站", "上", "，", "去", "忽悠", "藏", "家", "，", "特别", "北京", "东三环", "的", "一", "家", "单位", "，", "网站", "上", "放", "着", "放", "一", "张", "废旧", "电冰箱", "改装", "的", "设备", "，", "当", "文物鉴定", "仪器", "忽悠", "藏", "家", "，", "这", "类", "单位", "十有八九", "是", "骗人", "的", "。", "<", "br", "/", ">", "<", "br", "/", ">", "注意", "：", "<", "br", "/", ">", "1", "、", "国内", "保利", "，", "嘉德", "，", "其次", "外资", "企业", "佳士得", "，", "苏富比", "，", "目前", "不", "对外", "征集", "藏品", "，", "也", "未", "设", "任何", "办事处", "，", "个别", "拍卖", "业务员", "说", "我", "能", "帮", "你", "送", "进去", "，", "这", "是", "骗人", "的", "。", "保利", "，", "嘉德", "属于", "国际", "拍卖", "品牌", "，", "但", "普通", "人", "参加", "不", "了", "，", "保利", "只", "接待", "能", "住", "起", "总统套房", "的", "藏", "家", "，", "这一条", "，", "你", "就", "达", "不到", "，", "所以", "一般", "藏", "家", "生活", "层次", "太", "低", "，", "不宜", "参加", "。", "<", "br", "/", ">", "<", "br", "/", ">", "2", "，", "还有", "一", "种", "藏", "家", "，", "成交", "了", "故意", "说", "不", "成交", "，", "这种人", "见不得", "别人", "发财", "，", "其次", "有些", "藏", "家", "东西", "没", "被", "选上", "，", "故意", "说", "对方", "公司", "不好", "。", "<", "br", "/", ">", "<", "br", "/", ">", "3", "、", "拍卖公司", "业务员", "拉皮条", "，", "拉", "不到", "业务", "也", "互相", "诋毁", "其他", "公司", "，", "导致", "国内", "似乎", "没有", "几", "家", "好", "单位", "。", "<", "br", "/", ">", "<", "br", "/", ">", "收藏", "拍卖", "交易", "参考资料", "一", "：", "<", "br", "/", ">", "<", "br", "/", ">", "行业", "划分", "古董", "拍卖", "，", "鉴定", "，", "交易", "目前", "大部分", "单位", "集中", "的", "上海", "，", "北京", "、", "青岛", "。", "藏", "家", "参与", "前", "一定", "多", "比较", "，", "多", "了解", "，", "才能", "避免上当受骗", "，", "祝", "您", "发财", "。", "<", "br", "/", ">", "<", "br", "/", ">", "收藏", "拍卖", "交易", "参考资料", "二", "：", "<", "br", "/", ">", "<", "br", "/", ">", "关于", "拍卖", "资质", "与", "文物", "拍卖", "资质", "“", "文物", "”", "是", "国家", "备案", "发掘", "的", "藏品", "叫", "文物", "，", "或者", "从", "文物", "商店", "购买", "的", "藏品", "，", "叫", "文物", "。", "老百姓", "手", "里", "的", "藏品", "属于", "民间收藏", "艺术品", "，", "不", "属于", "文物", "。", "老百姓", "的", "手", "里", "的", "藏品", "，", "可以", "自由", "开", "古玩", "店", "，", "摆地摊", "等", "自由", "参与", "买卖", "交易", "。", "<", "br", "/", ">", "<", "br", "/", ">", "有些", "藏", "家", "问", "你", "单位", "有", "文物", "拍卖", "资质", "没", "？", "这", "属于", "知识", "稀少", "的", "提问", "，", "只要你", "的", "藏品", "来源", "不是", "从", "文物", "商店", "购买", "的", "，", "国内", "98", "%", "的", "拍卖公司", "，", "艺术品", "经营", "公司", "都", "可以", "给", "你", "拍卖", "，", "交易", "。", "<", "br", "/", ">", "<", "br", "/", ">", "文物", "拍卖", "资质", "，", "国家", "指定交易", "法院", "没收", "资产", "与", "不良资产", "，", "处理", "古董", "的", "公司", "，", "老百姓", "手", "里", "的", "藏品", "与", "文物", "没关系", "，", "属于", "自由", "买卖", "，", "无需", "任何", "资质", "。", "2015", "年", "国家", "为了", "鼓励", "文化市场", "发展", "，", "取缔", "各类", "资质", "的", "阻碍", "，", "一切", "从", "简", "，", "只要", "在", "工商注册", "的", "任何", "单位", "都", "可以", "有权", "经营", "收藏", "艺术品", "业务", "。", "<", "br", "/", ">", "<", "br", "/", ">", "收藏", "拍卖", "交易", "参考资料", "三", "：", "<", "br", "/", ">", "<", "br", "/", ">", "疯狂", "的", "混乱", "鉴定", "关于", "当前", "混乱", "的", "古董", "鉴定", "，", "一", "件", "古董", "拿去", "分别", "给", "八", "位", "专家", "看", "，", "能", "出", "四种", "不同", "的", "结果", "，", "每位", "专家", "各", "有", "各", "的", "观点", "，", "所以", "不要", "去", "纠结", "，", "藏品", "投放市场", "，", "有人", "买", "，", "就", "是", "真品", "，", "很多", "专家", "都是", "靠", "收", "鉴定", "证书", "费", "骗人", "的", "。", "<", "br", "/", ">", "<", "br", "/", ">", "还有", "机器", "检测", "都是", "人为", "操作", "，", "主要", "骗", "收", "鉴定", "费", "的", "。", "很多", "藏", "家", "给", "自己", "的", "藏品", "买", "了", "一", "堆", "鉴定证书", "，", "到头来", "一样", "卖", "不", "出去", "。", "鉴于", "疯狂", "的", "混乱", "鉴定", "市场", "，", "买家", "都是", "自己", "相信自己", "的", "眼光", "去", "购买", "藏品", "，", "作为", "藏", "家", "只要", "把", "藏品", "能", "投放", "到", "一", "个", "靠谱", "的", "单位", "，", "就", "等于", "成功", "了", "一", "大", "半", "，", "无需", "购买", "哪些", "没用", "的", "证书", "。", "<", "br", "/", ">", "<", "br", "/", ">", "收藏", "拍卖", "交易", "参考资料", "四", "：", "<", "br", "/", ">", "<", "br", "/", ">", "拍卖", "的", "风险", "拍卖", "有", "风险", "，", "建议", "大家", "谨慎", "参与", "，", "顶级", "品牌", "单位", "近些年", "的", "真实", "付款", "成交", "率", "不到", "50", "%", "，", "行情", "整体", "不乐观", "。", "有", "藏品", "大家", "尽量", "找", "古玩城", "开店", "的", "老板", "去", "推销", "卖掉", "，", "或者", "摆地摊", "处理", "掉", "，", "“", "拍卖", "”", "属于", "有钱人", "的", "风险投资", "，", "不适合", "普通", "老百姓", "参与", "。", "<", "br", "/", ">", "<", "br", "/", ">", "特别", "是", "天天", "给", "你", "打电话", "的", "公司", "，", "并", "不是你", "的", "藏品", "值钱", "，", "主要", "为", "收", "你", "的", "图录", "费", "，", "鉴定", "费", "、", "出关", "费", "、", "交易", "保证金", "等", "，", "一", "个", "个", "陷阱", "等着你", "钻", "入", "。", "<", "br", "/", ">", "<", "br", "/", ">", "国内", "正规", "单位", "，", "谁", "跟", "你", "啰嗦", "，", "谁", "给", "你", "打电话", "？", "个别", "收入", "低", "，", "经济", "困难", "的", "藏", "家", "，", "醒醒", "吧", "，", "几百万", "、", "几千万", "没", "那么", "好", "做梦", "。", "<", "br", "/", ">", "<", "br", "/", ">", "收藏", "拍卖", "交易", "参考资料", "五", "：", "<", "br", "/", ">", "<", "br", "/", ">", "正确", "判断", "与", "学习", "很多", "藏", "家", "是", "在", "拍卖", "上当受骗", "后", "才", "发", "恼", "骚", "，", "到", "时", "投诉", "，", "举报", "，", "维权", "都", "不起作用", "，", "导致", "雪上加霜", "。", "应该", "在", "参与", "之", "前", "，", "提", "三月", "考察", "，", "比较", "各", "个", "公司", "的", "企业文化", "，", "与", "服务", "特点", "，", "其次", "要", "知道", "自己", "的", "分量", "，", "你", "去", "参加", "拍卖", "，", "是", "为了", "求财", "，", "和", "去", "银行", "借款", "相似", "，", "你", "见过", "那个", "有钱", "的", "人", "向", "没", "钱", "的", "人", "低三下四", "，", "很多", "小", "公司", "一", "天", "给", "你", "五", "个", "电话", "，", "那", "是", "把", "你", "当", "神经病", "在", "忽悠", "，", "忽悠", "你", "去", "缴费", "，", "好", "公司", "不用", "忽悠", "，", "市场", "宾朋满座", "，", "门庭若市", "。", "<", "br", "/", ">", "<", "br", "/", ">", "收藏", "拍卖", "交易", "参考资料", "六", "：", "<", "br", "/", ">", "<", "br", "/", ">", "畸形发财", "心态", "因为", "很多", "知识", "匮乏", "、", "家庭", "困难", "，", "无知", "的", "农民", "朋友", "对", "钱", "没有", "概念", "，", "在", "拍卖公司", "巨额", "估价", "的", "诱惑", "下", "，", "估价", "2000", "万", "的", "藏品", "，", "先", "交", "5", "-", "-", "20", "万", "的", "服务费", "，", "这", "类", "农民", "想着", "只要", "我", "凑", "够", "20", "万", "，", "等于", "2000", "万", "很快", "就", "到", "手", "了", "，", "所以", "有", "抵押", "房产", "的", "，", "变卖", "生产", "工具", "牲畜", "牛羊", "的", "，", "东", "凑", "西", "借", "的", "，", "把", "20", "万", "交给", "拍卖公司", "后", "，", "然后", "把", "工作", "辞", "了", "，", "田", "地", "也", "荒", "了", "，", "忙", "着", "去", "预定", "宝马", "名车", "，", "结果", "拍卖", "结束", "，", "没", "成交", "当头一棒", "，", "20", "万", "打水漂", "了", "，", "盲目", "参与", "导致", "家破人亡", "的", "事迹", "时", "有", "发生", ".", "<", "br", "/", ">", "<", "br", "/", ">", "很简单", "的", "问题", "，", "很多", "藏", "家", "分析", "时", "就", "出", "问题", "了", "，", "试想一下", "，", "假如", "你", "委托", "四", "件", "东西", "最少", "能", "成交", "一", "件", "，", "你", "立刻", "就是", "百万富翁", "，", "如果", "那么", "容易", "发财", "的", "话", "，", "干脆", "把", "60", "万", "的", "房子", "卖掉", "，", "委托", "上", "100", "件", "东西", "，", "最少", "成交", "两", "件", "，", "得到", "500", "万", "也", "很", "划算", "，", "对", "不", "？", "<", "br", "/", ">", "<", "br", "/", ">", "今年", "大", "拍", "，", "十", "副", "齐白石", "的", "画", "，", "只", "成交", "了", "2", "副", "，", "那", "也是", "骗子", "吗", "，", "古董", "拍卖", "想", "成交", "就", "得", "多", "参与", "。", "保利", "，", "嘉德", "为什么", "不收", "低端", "藏", "家", "的", "东西", "，", "因为", "成交", "了", "大家", "高兴", "，", "失败", "了", "大家", "说", "骗子", "，", "所以", "藏", "家", "缴费", "了", "，", "有些", "东西", "不容易", "成交", "，", "导致", "藏", "家", "很郁闷", "，", "下结论", "为", "骗", "也是", "不合理", "的", "。", "<", "br", "/", ">", "<", "br", "/", ">", "收藏", "拍卖", "交易", "参考资料", "七", "：", "<", "br", "/", ">", "<", "br", "/", ">", "比较", "实力", "正规", "单位", "【", "像", "正规", "的", "保利", "嘉德", "，", "都是", "几", "百", "平米", "的", "办公室", "，", "藏品", "放在", "办公室", "与", "与", "展柜", "里", "买家", "随", "到", "随", "看", "】", "除此之外", "，", "行业", "内", "95", "%", "的", "小", "拍卖", "单位", "，", "租", "个", "实际", "使用面积", "60", "平米", "的", "小", "办公室", "，", "藏品", "签订", "委托", "合同", "后", "，", "把", "近", "千", "件", "藏品", "堆放", "在", "潮湿", "的", "地下室", "里", "，", "不见天日", "存放", "大", "半年", "，", "然后", "等到", "拍卖", "的", "几天", "才", "拿出", "藏品", "，", "去", "小", "酒店", "花", "五六千", "元", "租", "个", "场地", "，", "着急", "上火", "的", "预展", "一", "两天", "卖", "不", "出去", "几", "件", "，", "等于", "完成", "拍卖", "活动", "，", "这种", "方式", "几乎没有", "卖东西", "的", "任何", "希望", "。", "<", "br", "/", ">", "<", "br", "/", ">", "收藏", "拍卖", "交易", "参考资料", "八", "：", "<", "br", "/", ">", "<", "br", "/", ">", "什么", "是", "不", "靠谱", "拍卖", "目前", "90", "%", "的", "拍卖公司", "，", "电话", "频繁", "忽悠", "没", "脑子", "的", "老百姓", "参加", "，", "征集", "上", "1000", "件", "后", "，", "就", "开始", "准备", "拍卖会", "，", "拍卖会", "的", "整个", "过程", "，", "就是", "去", "酒店", "租", "两天", "场地", "，", "把", "1000", "件", "藏品", "展示", "一", "下", "，", "等于", "在", "预展", "两天", "的", "预展", "现场", "，", "如果", "你", "仔细观察", "的", "话", "，", "前", "去", "观赏", "藏品", "的", "人", "，", "除了", "几", "十", "个", "委托人", "在", "预展", "现场", "来", "回", "瞎", "出", "溜", "，", "几乎没有", "任何", "买家", "到场", "观看", "，", "两天", "预展", "结束", "。", "第三天", "开始", "拍卖", "，", "拍卖", "会场", "在", "座", "的", "95", "%", "是", "藏", "家", "委托人", "，", "也", "就是", "卖东西", "的", "人", "，", "为了", "掩饰", "藏", "家", "，", "这", "类", "拍卖公司", "话费", "100", "元", "雇佣", "一些", "无业游民", "，", "老弱病残", "来", "充当", "买家", "，", "举牌", "子", "。", "<", "br", "/", ">", "<", "br", "/", ">", "我", "参加", "过", "七次", "拍卖", "，", "时常", "看见", "一些", "拍卖公司", "的", "买家", "大老板", "，", "拍卖", "到", "中午", "吃饭时", "，", "现场", "抢", "牛奶", "，", "抢", "面包", "。", "狼狈不堪", "，", "拍卖", "结束", "暗", "中", "一打听", "，", "属于", "雇", "来", "的", "失业", "低保户", "。", "稍", "有", "思想", "的", "老百姓", "就能", "看", "出门", "道", "，", "<", "br", "/", ">", "<", "br", "/", ">", "其次", "一", "个", "小", "拍卖公司", "，", "不", "去", "招商", "，", "租", "个", "80", "平米", "的", "办公室", "，", "天天", "雇人", "给", "藏", "家", "打电话", "，", "忽悠", "藏", "家", "送", "拍", "，", "这种", "单位", "那", "来", "的", "买家", "，", "说实话", "还", "不如", "你", "自己去", "摆地摊", "的", "效果好", "。", "<", "br", "/", ">", "<", "br", "/", ">", "靠谱", "的", "拍卖", "，", "就是", "观察", "这个", "公司", "的", "实际", "营业", "方式", "，", "具体", "给", "藏", "家", "做", "了", "那些", "可以", "看", "得到", "的", "真实", "服务", "，", "看不到", "的", "服务", "就是", "假", "的", "不", "靠谱", "的", "。", "<", "br", "/", ">", "<", "br", "/", ">", "收藏", "拍卖", "交易", "参考资料", "九", "：", "看", "服务", "与", "行情", "<", "br", "/", ">", "<", "br", "/", ">", "引用", "资料", "1", "、", "中国", "嘉德", "拍卖公司", "，", "<", "br", "/", ">", "<", "br", "/", ">", "不好", "的", "现象", "需要", "抵制", "，", "改变", "风气", "大家", "应该", "互相学习", "、", "探讨", "、", "研究", "。", "收藏", "爱好者", "应该", "把", "自己", "水平", "提高", "，", "进一步深化", "收藏", "文化", "，", "进入", "文化", "领域", "，", "而", "不是", "简单", "的", "收藏", "，", "收藏", "不能", "狭隘", "地", "只", "为", "经济", "利益", "，", "而是", "为了", "爱好", "、", "传承", "我们", "国家", "的", "文化", "，", "几", "年", "以后", "它", "给", "你", "带来", "的", "经济", "利益", "只是", "个", "附加值", "而已", "。", "<", "br", "/", ">", "<", "br", "/", ">", "【", "引用", "资料", "2", "、", "-", "-", "-", "青岛", "大前门", "集团", "拍卖公司", "】", "：", "<", "br", "/", ">", "<", "br", "/", ">", "关于", "藏品", "估价", "：", "通俗", "点", "说", "，", "你", "家", "有", "个", "漂亮", "闺女", "，", "嫁", "个", "普通人", "老百姓", "比较", "随便", "，", "嫁个村长", "，", "一", "个", "村里", "就", "一", "个", "村长", "，", "这个", "可以", "有", "机会", "，", "嫁给", "县长", "、", "也是", "可以", "奢望", "的", "，", "，", "，", "哪", "嫁给", "市长", "、", "你", "觉得", "好", "嫁", "吗", "？", "-", "-", "-", "-", "-", "-", "-", "很多", "思想", "不成熟", "的", "藏", "家", "，", "在", "藏品", "的", "估价", "要求", "上", "，", "理想", "根本", "不是", "把", "闺女", "嫁给", "省长", "那么简单", "，", "把", "一", "件", "低端", "藏品", "要求", "拍卖", "百万", "、", "千万", "、", "无疑", "是", "把", "闺女", "必须", "要", "嫁给", "国家主席", "。", "（", "合理", "的", "估价", "，", "藏品", "想", "成交", "，", "一定", "估价", "要", "合适", "，", "价格", "符合", "市场行情", "，", "在哪里", "都", "有", "机会", "交易", "。", "）", "<", "br", "/", ">", "<", "br", "/", ">", "【", "引用", "资料", "3", "、", "-", "-", "-", "保利", "拍卖公司", "】", "<", "br", "/", ">", "<", "br", "/", ">", "收藏", "逐渐", "普及", "化", "，", "藏品", "的", "市值", "是", "藏品", "自身", "创造", "的", "，", "是", "金子", "无论", "放在", "哪里", "都会", "发光", "。", "<", "br", "/", ">", "<", "br", "/", ">", "***", "藏", "家", "注意", "，", "国内", "目前有", "2000", "家", "拍卖", "单位", "，", "其中", "98", "%", "的", "单位", "都是", "前期", "收费", "的", "，", "收费", "的", "公司", "可以", "分为", "以下", "三种", "。", "<", "br", "/", ">", "<", "br", "/", ">", "不", "成交", "不收", "任何费用", "的", "公司", "（", "这", "类", "公司", "国内", "有", "五", "六", "家", "）", "<", "br", "/", ">", "<", "br", "/", ">", "不收", "前期", "费用", "，", "流拍", "后", "要", "收", "流拍", "费", "的", "（", "国内", "有", "20", "家", "）", "<", "br", "/", ">", "委托", "前", "不收", "费用", "，", "委托", "后", "暗藏", "费用", "的", "（", "欺诈", "公司", "一直", "这样", "，", "说", "有", "买家", "要", "藏品", "，", "等你", "去", "鉴定", "，", "真品", "就", "收", "，", "其次", "，", "买家", "已经", "付款", "了", "，", "需要", "缴纳", "一定", "的", "保证金", "，", "最后", "找个理由", "不退", "了", "，", "或者", "公司", "跑路", "了", "，", "藏品", "也", "没有了", "。", "）", "<", "br", "/", ">", "<", "br", "/", ">", "4", ".", "当前", "不", "成交", "不", "收取", "任何费用", "的", "单位", "目前有", "<", "br", "/", ">", "<", "br", "/", ">", "北京", "保利", "拍卖", "、", "（", "不对", "普通", "藏", "家", "征集", "）", "<", "br", "/", ">", "北京", "嘉德", "拍卖", "、", "（", "不对", "普通", "藏", "家", "征集", "）", "<", "br", "/", ">", "北京", "翰海", "拍卖", "、", "（", "不对", "普通", "藏", "家", "征集", "）", "<", "br", "/", ">", "北京", "匡时", "拍卖", "<", "br", "/", ">", "南宁", "中", "景", "美术馆", "<", "br", "/", ">", "<", "br", "/", ">", "上海", "荣宝斋", "拍卖", "<", "br", "/", ">", "上海", "老城隍庙", "<", "br", "/", ">", "上海", "朵云轩", "<", "br", "/", ">", "上海", "道", "明", "拍卖", "<", "br", "/", ">", "上海", "嘉禾", "拍卖", "<", "br", "/", ">", "<", "br", "/", ">", "青岛", "新天地", "拍卖", "，", "<", "br", "/", ">", "青岛", "中", "艺", "拍卖", "，", "<", "br", "/", ">", "青岛", "银座", "拍卖", "，", "<", "br", "/", ">", "青岛", "大前门", "拍卖", "，", "<", "br", "/", ">", "青岛", "麒麟阁", "拍卖", "，", "<", "br", "/", ">", "<", "br", "/", ">", "以上", "单位", "藏品", "不", "成交", "，", "没有", "前", "后期", "费用", "，", "不", "收", "你", "一分钱", "费用", "，", "按时", "拿走", "即可", "。", "<", "br", "/", ">", "<", "br", "/", ">", "其次", "藏品", "最安全", "的", "交易", "方法", "去", "摆地摊", "卖掉", "，", "没", "任何", "损失", "，", "还", "现金", "交易", "。", "<", "/", "p", ">"]
		],
		"paragraphs": ["<p><strong>最近行情价，360万，</strong></p><p><br /></p><p>藏品鉴定出售一定要去行业内<br /><br />属于常规的注册单位，不用担心，因为现在注册个拍卖公司成本不到壹万伍仟元，所以注册很方便，藏家无需担心公司是假的，多与工作人员联系，费用能接受就参加。<br /><br />经营古董类的单位不少，参与前一定问清楚，觉得适合再去参加，一旦流拍后要能接受费用损失的现实，否则悔之晚也。<br /><br />其次藏品最安全的交易方法去摆地摊卖掉，没任何损失，还现金交易。<br /><br />以下为藏品交易与参加拍卖的常识：<br /><br />请仔细阅读，避免上当受骗。我本人参加拍卖七八年，总计花费25万以上，有血有泪，在此公平客观的回答，是为了让更多的藏家少受一分伤害， 阿弥托佛，苦海无边，回头是岸。<br /><br />藏友问某某公司是否正规？<br /><br />是不是骗子？可靠吗？任何单位都是法制注册营业的，至于服务质量，收费的标准，得自己去考察衡量，一定谨慎避免高收费，藏品不成交造成的伤害。特别是夸口说保证能成交的公司，十有八九骗费用的公司。法律规定正规单位不能收购倒卖古董，其次个别单位以现金收购古董为名，让藏家先鉴定，真品就现金收购，其实他们没有买家，忽悠藏家交完鉴定费后，鉴定时故意告诉你的东西是假的。鉴定费不退了，保证金也不退了。<br /><br />其次很多业务员自称经理，总监，王总什么的，天天打电话忽悠藏家，其实就是普通业务员拉皮条，专忽悠没见识的老实人，然后说能把你介绍，拉拢到五六家拍卖公司去缴费，等你委托缴费后，业务员与公司一人一半分你的委托费。你想想这是公司吗？<br /><br />还有，动不动在网站把十几位知名专家的照片贴在网站上，去忽悠藏家，特别北京东三环的一家单位，网站上放着放一张废旧电冰箱改装的设备，当文物鉴定仪器忽悠藏家，这类单位十有八九是骗人的。<br /><br />注意：<br />1、国内保利，嘉德，其次外资企业佳士得，苏富比，目前不对外征集藏品，也未设任何办事处，个别拍卖业务员说我能帮你送进去，这是骗人的。保利，嘉德属于国际拍卖品牌，但普通人参加不了，保利只接待能住起总统套房的藏家，这一条，你就达不到，所以一般藏家生活层次太低，不宜参加。<br /><br />2，还有一种藏家，成交了故意说不成交，这种人见不得别人发财，其次有些藏家东西没被选上，故意说对方公司不好。<br /><br />3、拍卖公司业务员拉皮条，拉不到业务也互相诋毁其他公司，导致国内似乎没有几家好单位。<br /><br />收藏拍卖交易参考资料一：<br /><br />行业划分古董拍卖，鉴定，交易目前大部分单位集中的上海，北京、青岛。藏家参与前一定多比较，多了解，才能避免上当受骗，祝您发财。<br /><br />收藏拍卖交易参考资料二：<br /><br />关于拍卖资质与文物拍卖资质“文物”是国家备案发掘的藏品叫文物，或者从文物商店购买的藏品，叫文物。老百姓手里的藏品属于民间收藏艺术品，不属于文物。老百姓的手里的藏品，可以自由开古玩店，摆地摊等自由参与买卖交易。<br /><br />有些藏家问你单位有文物拍卖资质没？这属于知识稀少的提问，只要你的藏品来源不是从文物商店购买的，国内98%的拍卖公司，艺术品经营公司都可以给你拍卖，交易。<br /><br />文物拍卖资质，国家指定交易法院没收资产与不良资产，处理古董的公司，老百姓手里的藏品与文物没关系，属于自由买卖，无需任何资质。2015年国家为了鼓励文化市场发展，取缔各类资质的阻碍，一切从简，只要在工商注册的任何单位都可以有权经营收藏艺术品业务。<br /><br />收藏拍卖交易参考资料三：<br /><br />疯狂的混乱鉴定关于当前混乱的古董鉴定，一件古董拿去分别给八位专家看，能出四种不同的结果，每位专家各有各的观点，所以不要去纠结，藏品投放市场，有人买，就是真品，很多专家都是靠收鉴定证书费骗人的。<br /><br />还有机器检测都是人为操作，主要骗收鉴定费的。很多藏家给自己的藏品买了一堆鉴定证书，到头来一样卖不出去。鉴于疯狂的混乱鉴定市场，买家都是自己相信自己的眼光去购买藏品，作为藏家只要把藏品能投放到一个靠谱的单位，就等于成功了一大半，无需购买哪些没用的证书。<br /><br />收藏拍卖交易参考资料四：<br /><br />拍卖的风险拍卖有风险，建议大家谨慎参与，顶级品牌单位近些年的真实付款成交率不到50%，行情整体不乐观。有藏品大家尽量找古玩城开店的老板去推销卖掉，或者摆地摊处理掉，“拍卖”属于有钱人的风险投资，不适合普通老百姓参与。<br /><br />特别是天天给你打电话的公司，并不是你的藏品值钱，主要为收你的图录费，鉴定费、出关费、交易保证金等，一个个陷阱等着你钻入。<br /><br />国内正规单位，谁跟你啰嗦，谁给你打电话？个别收入低，经济困难的藏家，醒醒吧，几百万、几千万没那么好做梦。<br /><br />收藏拍卖交易参考资料五：<br /><br />正确判断与学习很多藏家是在拍卖上当受骗后才发恼骚，到时投诉，举报，维权都不起作用，导致雪上加霜。应该在参与之前，提三月考察，比较各个公司的企业文化，与服务特点，其次要知道自己的分量，你去参加拍卖，是为了求财，和去银行借款相似，你见过那个有钱的人向没钱的人低三下四，很多小公司一天给你五个电话，那是把你当神经病在忽悠，忽悠你去缴费，好公司不用忽悠，市场宾朋满座，门庭若市。<br /><br />收藏拍卖交易参考资料六：<br /><br />畸形发财心态因为很多知识匮乏、家庭困难，无知的农民朋友对钱没有概念，在拍卖公司巨额估价的诱惑下，估价2000万的藏品，先交5--20万的服务费，这类农民想着只要我凑够20万，等于2000万很快就到手了，所以有抵押房产的，变卖生产工具牲畜牛羊的，东凑西借的，把20万交给拍卖公司后，然后把工作辞了，田地也荒了，忙着去预定宝马名车，结果拍卖结束，没成交当头一棒，20万打水漂了，盲目参与导致家破人亡的事迹时有发生.<br /><br />很简单的问题，很多藏家分析时就出问题了，试想一下，假如你委托四件东西最少能成交一件，你立刻就是百万富翁，如果那么容易发财的话，干脆把60万的房子卖掉，委托上100件东西，最少成交两件，得到500万也很划算，对不？<br /><br />今年大拍，十副齐白石的画，只成交了2副，那也是骗子吗，古董拍卖想成交就得多参与。保利，嘉德为什么不收低端藏家的东西，因为成交了大家高兴，失败了大家说骗子，所以藏家缴费了，有些东西不容易成交，导致藏家很郁闷，下结论为骗也是不合理的。<br /><br />收藏拍卖交易参考资料七：<br /><br />比较实力正规单位【像正规的保利嘉德，都是几百平米的办公室，藏品放在办公室与与展柜里买家随到随看】除此之外，行业内95%的小拍卖单位，租个实际使用面积60平米的小办公室，藏品签订委托合同后，把近千件藏品堆放在潮湿的地下室里，不见天日存放大半年，然后等到拍卖的几天才拿出藏品，去小酒店花五六千元租个场地，着急上火的预展一两天卖不出去几件，等于完成拍卖活动，这种方式几乎没有卖东西的任何希望。<br /><br />收藏拍卖交易参考资料八：<br /><br />什么是不靠谱拍卖目前90%的拍卖公司，电话频繁忽悠没脑子的老百姓参加，征集上1000件后，就开始准备拍卖会，拍卖会的整个过程，就是去酒店租两天场地，把1000件藏品展示一下，等于在预展两天的预展现场，如果你仔细观察的话，前去观赏藏品的人，除了几十个委托人在预展现场来回瞎出溜，几乎没有任何买家到场观看，两天预展结束。第三天开始拍卖，拍卖会场在座的95%是藏家委托人，也就是卖东西的人，为了掩饰藏家，这类拍卖公司话费100元雇佣一些无业游民，老弱病残来充当买家，举牌子。<br /><br />我参加过七次拍卖，时常看见一些拍卖公司的买家大老板，拍卖到中午吃饭时，现场抢牛奶，抢面包。狼狈不堪，拍卖结束暗中一打听，属于雇来的失业低保户。稍有思想的老百姓就能看出门道，<br /><br />其次一个小拍卖公司，不去招商，租个80平米的办公室，天天雇人给藏家打电话，忽悠藏家送拍，这种单位那来的买家，说实话还不如你自己去摆地摊的效果好。<br /><br />靠谱的拍卖，就是观察这个公司的实际营业方式，具体给藏家做了那些可以看得到的真实服务，看不到的服务就是假的不靠谱的。<br /><br />收藏拍卖交易参考资料九： 看服务与行情<br /><br />引用资料1、中国嘉德拍卖公司，<br /><br />不好的现象需要抵制，改变风气大家应该互相学习、探讨、研究。收藏爱好者应该把自己水平提高，进一步深化收藏文化，进入文化领域，而不是简单的收藏，收藏不能狭隘地只为经济利益，而是为了爱好、传承我们国家的文化，几年以后它给你带来的经济利益只是个附加值而已。<br /><br />【引用资料2、---青岛大前门集团拍卖公司】：<br /><br />关于藏品估价：通俗点说，你家有个漂亮闺女，嫁个普通人老百姓比较随便，嫁个村长，一个村里就一个村长，这个可以有机会，嫁给县长、也是可以奢望的，，，哪嫁给市长、你觉得好嫁吗？-------很多思想不成熟的藏家，在藏品的估价要求上，理想根本不是把闺女嫁给省长那么简单，把一件低端藏品要求拍卖百万、千万、无疑是把闺女必须要嫁给国家主席。（ 合理的估价，藏品想成交，一定估价要合适，价格符合市场行情，在哪里都有机会交易。）<br /><br />【引用资料3、---保利拍卖公司】<br /><br />收藏逐渐普及化， 藏品的市值是藏品自身创造的，是金子无论放在哪里都会发光。<br /><br />***藏家注意，国内目前有2000家拍卖单位，其中98%的单位都是前期收费的，收费的公司可以分为以下三种。<br /><br />不成交不收任何费用的公司 （这类公司国内有五六家）<br /><br />不收前期费用，流拍后要收流拍费的 （国内有20家）<br />委托前不收费用，委托后暗藏费用的 （欺诈公司一直这样，说有买家要藏品，等你 去鉴定，真品就收，其次，买家已经付款了，需要缴纳一定的保证金，最后找个理由 不退了，或者公司跑路了，藏品也没有了。）<br /><br />4. 当前不成交不收取任何费用的单位目前有<br /><br />北京保利拍卖、 （不对普通藏家征集）<br />北京嘉德拍卖、 （不对普通藏家征集）<br />北京翰海拍卖、 （不对普通藏家征集）<br />北京匡时拍卖<br />南宁中景美术馆<br /><br />上海荣宝斋拍卖<br />上海老城隍庙<br />上海朵云轩<br />上海道明拍卖<br />上海嘉禾拍卖<br /><br />青岛新天地拍卖，<br />青岛中艺拍卖，<br />青岛银座拍卖，<br />青岛大前门拍卖，<br />青岛麒麟阁拍卖，<br /><br />以上单位藏品不成交，没有前后期费用，不收你一分钱费用，按时拿走即可。<br /><br />其次藏品最安全的交易方法去摆地摊卖掉，没任何损失，还现金交易。</p>"],
		"bs_rank_pos": 2
	}, {
		"is_selected": True,
		"title": "吴昌硕字画值多少钱,拍卖成交记录和价格",
		"most_related_para": 0,
		"segmented_title": ["吴昌硕", "字画", "值", "多少", "钱", ",", "拍卖", "成交", "记录", "和", "价格"],
		"segmented_paragraphs": [
			["精品", "真迹", "每", "平尺", "20", "万", "元", "左右", "。", "现在", "以", "拍卖", "为", "名", "的", "骗子", "很多", "，", "要", "小心", "被骗", "。"]
		],
		"paragraphs": ["精品真迹每平尺20万元左右。现在以拍卖为名的骗子很多，要小心被骗。"],
		"bs_rank_pos": 3
	}, {
		"is_selected": False,
		"title": "吴昌硕的作品《枇杷》 价值多少钱_百度知道",
		"most_related_para": 0,
		"segmented_title": ["吴昌硕", "的", "作品", "《", "枇杷", "》", "价值", "多少", "钱", "_", "百度", "知道"],
		"segmented_paragraphs": [
			["吴昌硕", "的", "作品", "《", "枇杷", "》", "价值", "多少", "钱", "？", "你", "要", "去", "卖", "了", "才", "知道", "，", "并", "不是", "说", "谁", "在这里", "说", "它", "值", "多少", "钱", "就", "真", "的", "值", "多少", "钱", "。", "目前", "中国", "画家", "的", "作品", "没有", "谁", "的", "作品", "比", "黄泽金", "、", "崔如琢", "的", "作品", "卖", "得", "贵", "。"],
			["真品", "就", "值钱"]
		],
		"paragraphs": ["吴昌硕的作品《枇杷》 价值多少钱？你要去卖了才知道，并不是说谁在这里说它值多少钱就真的值多少钱。目前中国画家的作品没有谁的作品比黄泽金、崔如琢的作品卖得贵。", "真品就值钱"],
		"bs_rank_pos": 6
	}, {
		"is_selected": False,
		"title": "一幅吴昌硕的山水画拍卖价多少?",
		"most_related_para": 1,
		"segmented_title": ["一", "幅", "吴昌硕", "的", "山水画", "拍卖", "价", "多少", "?"],
		"segmented_paragraphs": [
			["吴昌硕", "辛酉", "（", "1921", "年", "）", "春", "作", "山水画", "《", "风雨归舟", "》", "立轴", "估价", "280", ",", "000", "-", "-", "350", ",", "000", "成交价", "330", ",", "000", "北京", "长风", "拍卖", "有限公司", "2007", "-", "03", "-", "18"],
			["被", "海外", "书画", "界", "誉为", "“", "唐", "之后", "第", "一人", "”", "的", "近代", "艺术", "大师", "吴昌硕", "(", "1844", "一", "1927", ")", "，", "出生于", "浙江", "安吉", "诗书", "之", "家", "，", "自", "幼", "受", "家庭", "熏陶", "，", "在", "金石", "、", "篆刻", "及", "书法", "方面", "造诣", "深厚", "，", "其", "作品", "凝练", "遒劲", "、", "气势磅礴", "，", "是", "中国", "近代", "集", "诗", "、", "书", "、", "画", "、", "印", "于一身", "的", "艺术", "大师", "。", "吴昌硕", "从事", "绘画艺术", "起步", "虽", "晚", "，", "却", "深", "通", "画", "理", "，", "主张", "“", "画", "当", "出", "己", "意", "”", "，", "并", "迅速", "登上", "绘画艺术", "巅峰", "；", "其", "绘画", "特点", "是", "以", "金石", "入", "画", "，", "画风", "质朴", "，", "色彩", "厚重", "浓艳", "。", "他", "所", "创立", "的", "以", "篆籀", "之", "笔法", "作画", "，", "以纯", "色", "点染", "的", "大", "写意", "花鸟画", "的", "审美", "思想", "，", "为", "中国", "近现代", "写意", "花鸟画", "开启", "了", "新纪元", "。", "作为", "承前启后", "的", "一代宗师", "，", "吴昌硕", "以", "其", "自身", "的", "感召力", "和", "作品", "的", "感染力", "，", "深刻", "地", "影响", "了", "世纪", "以来", "的", "几代", "艺术家", "，", "如", "北京", "画派", "的", "陈师曾", "、", "齐白石", "，", "现代", "最具", "实力", "的", "大家", "傅抱石", "、", "李可染", "、", "黄宾虹", "以及", "近代", "海派诸家", "等", "无", "不", "源", "自", "于", "吴昌硕", "，", "他", "对", "中国", "传统", "书画", "印", "艺术", "的", "走向", "产生", "了", "深远", "的", "影响", "，", "直至", "今日", "依旧", "长盛不衰", "。", "像", "吴昌硕", "《", "墨", "石", "图", "》", "前", "几", "年", "拍卖", "到", "700000", "人民币", "了", "，", "要", "是", "他", "的", "力", "作", "的", "话", "，", "是", "很", "有", "升值", "的", "潜力", "的", "·"]
		],
		"paragraphs": ["吴昌硕 辛酉（1921年）春作 山水画《风雨归舟》 立轴估价280,000--350,000成交价330,000 北京长风拍卖有限公司2007-03-18", "被海外书画界誉为“唐之后第一人”的近代艺术大师吴昌硕(1844一1927)，出生于浙江安吉诗书之家，自幼受家庭熏陶，在金石、篆刻及书法方面造诣深厚，其作品凝练遒劲、气势磅礴，是中国近代集诗、书、画、印于一身的艺术大师。吴昌硕从事绘画艺术起步虽晚，却深通画理，主张“画当出己意”，并迅速登上绘画艺术巅峰；其绘画特点是以金石入画，画风质朴，色彩厚重浓艳。他所创立的以篆籀之笔法作画，以纯色点染的大写意花鸟画的审美思想，为中国近现代写意花鸟画开启了新纪元。    作为承前启后的一代宗师，吴昌硕以其自身的感召力和作品的感染力，深刻地影响了世纪以来的几代艺术家，如北京画派的陈师曾、齐白石，现代最具实力的大家傅抱石、李可染、黄宾虹以及近代海派诸家等无不源自于吴昌硕，他对中国传统书画印艺术的走向产生了深远的影响，直至今日依旧长盛不衰。    像吴昌硕《墨石图》前几年拍卖到700000人民币了，要是他的力作的话，是很有升值的潜力的·"],
		"bs_rank_pos": 11
	}],
	"answer_spans": [
		[0, 31]
	],
	"answer_docs": [0],
	"fake_answers": ["要看品相和尺寸大小，吴昌硕好多字画由其弟子代画然后盖其章，真迹精品每平尺大约在三十至五十万不等。"],
	"question": "吴昌硕字画拍卖价格",
	"segmented_answers": [
		["要", "看", "品", "相", "和", "尺寸大小", "，", "吴昌硕", "好多", "字画", "由", "其", "弟子", "代", "画", "然后", "盖其章", "，", "真迹", "精品", "每", "平尺", "大约", "在", "三", "十", "至", "五", "十", "万", "不等", "。"],
		["最近", "行情", "价", "，", "360", "万", "。"],
		["精品", "真迹", "每", "平尺", "20", "万", "元", "左右", "。"]
	],
	"answers": ["要看品相和尺寸大小，吴昌硕好多字画由其弟子代画然后盖其章，真迹精品每平尺大约在三十至五十万不等。", "最近行情价，360万。", "精品真迹每平尺20万元左右。"],
	"entity_answers": [
		["三十至五十万不等"],
		["360万"],
		["20万元左右"]
	],
	"segmented_question": ["吴昌硕", "字画", "拍卖", "价格"],
	"question_type": "ENTITY",
	"question_id": 91266,
	"fact_or_opinion": "OPINION",
	"match_scores": [1.0]
}